БухЭксп/Catalogs/CW_ТипыКоносаментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТипыКоносаментов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетДоговораСКлиентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетКонтейнеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПортаПерегрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетГармонизированногоКода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетКлассаОпасности</Name>
					<Comment>Учет класса опасности груза по классификации IMO (International Maritime Organization, Международная морская организация) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеРеквизитовМониторинговымПараметрам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитКоносамента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_РеквизитыКоносамента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрОбъекта</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КопироватьВГрузоперевозки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КопироватьВЗаказы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_РеквизитыКоносамента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеквизитыКоносамента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Букинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесБрутто</Name>
					<Comment>Брутто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесНетто</Name>
					<Comment>Нетто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесТары</Name>
					<Comment>Вес тары в килограммах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГармонизированныйКод</Name>
					<Comment>Код груза в соответствии с классификацией ВТО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПогрузкиНаСудно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Извещать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассОпасности</Name>
					<Comment>Классификация опасного груза IMO CLASS/UN NO</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Comment>Количество упаковок в грузовой единице</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем груза в м3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Comment>Описание груза </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пломба</Name>
					<Comment>Номер пломбы грузовой единицы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Наименование упаковки груза в грузовой единице </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТипыКоносаментов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	CW_МониторинговыеПараметрыСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);   
	
	
	УчетЗаказовПриИзмененииНаСервере();

КонецПроцедуры    


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПараметрыФункциональныхОпций();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыФункциональныхОпций()
	
	
	УстанавлваемыеПараметры = Новый Структура;
	УстанавлваемыеПараметры.Вставить("CW_ТипКоносамента", Объект.Ссылка);
	
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавлваемыеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	CW_МониторинговыеПараметрыКлиент.ВосстановитьСостояниеГрупп(ЭтаФорма);  

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	CW_МониторинговыеПараметрыСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

	УстановитьПараметрыФункциональныхОпций();
	
КонецПроцедуры   

&НаКлиенте
Процедура МониторинговыеПараметрыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_МониторинговыеПараметрыКлиент.ПередНачаломДобавленияПараметров(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда) 
	
	CW_МониторинговыеПараметрыКлиент.ПереместитьЭлемент(ЭтаФорма, -1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)

	CW_МониторинговыеПараметрыКлиент.ПереместитьЭлемент(ЭтаФорма, 1);
	
КонецПроцедуры  

&НаКлиенте
Процедура СвернутьВсе(Команда)  
	
	CW_МониторинговыеПараметрыКлиент.СвернутьГруппыПараметров(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда) 
	
	CW_МониторинговыеПараметрыКлиент.РазвернутьГруппыПараметров(ЭтаФорма);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВосстановитьСостояниеГрупп(Команда)
	
	CW_МониторинговыеПараметрыКлиент.ВосстановитьСостояниеГрупп(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура УчетЗаказовПриИзменении(Элемент)
	УчетЗаказовПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура УчетЗаказовПриИзмененииНаСервере()

	Элементы.СоответствиеРеквизитовМониторинговымПараметрамКопироватьВЗаказ.Видимость = Объект.УчетЗаказов; 
	
	Если Не Объект.УчетЗаказов Тогда
		Для Каждого СтрокаТаблицы из Объект.СоответствиеРеквизитовМониторинговымПараметрам Цикл
			СтрокаТаблицы.КопироватьВЗаказы = Ложь;
		КонецЦикла;                     
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетДоговораСКлиентомПриИзменении(Элемент)
	УчетДоговораСКлиентомПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура УчетДоговораСКлиентомПриИзмененииНаСервере()
	
	Если Не Объект.УчетДоговораСКлиентом Тогда  
		Отбор = Новый Структура;
		Отбор.Вставить("РеквизитКоносамента", Перечисления.CW_РеквизитыКоносамента.ДоговорСКлиентом);
		
		НайденныеСтроки = Объект.СоответствиеРеквизитовМониторинговымПараметрам.НайтиСтроки(Отбор);
		Для Каждого СтрокаТаблицы из НайденныеСтроки Цикл
			Объект.СоответствиеРеквизитовМониторинговымПараметрам.Удалить(СтрокаТаблицы);
		КонецЦикла;                     
	КонецЕсли;     
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьРеквизиты(Команда)
	ЗаполнитьРеквизитыНаСервере();
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьРеквизитыНаСервере()
	
	Для Каждого ЗначениеПеречисления из Метаданные.Перечисления.CW_РеквизитыКоносамента.ЗначенияПеречисления Цикл
		ЗначениеПеречисленияСсылка = Перечисления.CW_РеквизитыКоносамента[ЗначениеПеречисления.Имя];
		
		Отбор = Новый Структура;
		Отбор.Вставить("РеквизитКоносамента", ЗначениеПеречисленияСсылка);
		
		НайденныеСтроки = Объект.СоответствиеРеквизитовМониторинговымПараметрам.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.СоответствиеРеквизитовМониторинговымПараметрам.Добавить();	
			НоваяСтрока.РеквизитКоносамента =  ЗначениеПеречисленияСсылка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитовМониторинговымПараметрамРеквизитКоносаментаПриИзменении(Элемент) 
	
	ТекущаяСтрока= Элементы.СоответствиеРеквизитовМониторинговымПараметрам.ТекущаяСтрока;
	КонтрольУникальностиРеквизитовПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры    

&НаСервере
Процедура КонтрольУникальностиРеквизитовПриИзмененииНаСервере(ТекущаяСтрока) 
	
	СтрокаТекущая 	= Объект.СоответствиеРеквизитовМониторинговымПараметрам.НайтиПоИдентификатору(ТекущаяСтрока);
	ИндексСтроки 	= Объект.СоответствиеРеквизитовМониторинговымПараметрам.Индекс(СтрокаТекущая);
	
	Отказ = Ложь;
	
	Для Каждого СтрокаТаблицы из Объект.СоответствиеРеквизитовМониторинговымПараметрам Цикл
		Если СтрокаТаблицы = СтрокаТекущая Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.РеквизитКоносамента = СтрокаТекущая.РеквизитКоносамента Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизит "+СокрЛП(СтрокаТаблицы.РеквизитКоносамента)+" уже добавлен!",,
			"СоответствиеРеквизитовМониторинговымПараметрам["+Формат(ИндексСтроки,"ЧГ=0")+"].РеквизитКоносамента",
			"Объект", Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		СтрокаТекущая.РеквизитКоносамента = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МониторинговыеПараметрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	Если Поле.Имя = "КопироватьВГрузоперевозки" 
		или Поле.Имя = "КопироватьВЗаказы" Тогда    
		СтандартнаяОбработка = Ложь;
		МониторинговыеПараметрыВыборНаСервере(ВыбраннаяСтрока, Поле.Имя);
		Элементы.МониторинговыеПараметры.Обновить();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура МониторинговыеПараметрыВыборНаСервере(ВыбраннаяСтрока, ИмяРеквизита)  
	
	Если ВыбраннаяСтрока.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрОбъект = ВыбраннаяСтрока.ПолучитьОбъект();
	ПараметрОбъект[ИмяРеквизита] = Не ПараметрОбъект[ИмяРеквизита];  
	ПараметрОбъект.ОбменДанными.Загрузка = Истина;
	ПараметрОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитовМониторинговымПараметрамИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.СоответствиеРеквизитовМониторинговымПараметрам.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	АдресСхемы = ПолучитьАдресСхемы(ТекущаяСтрока);
	Если АдресСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСхемы", АдресСхемы);   

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);	

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборРеквизита", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.CW_ТипыКоносаментов.Форма.ДоступныеПоля", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьВыборРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗавершитьВыборРеквизитаНаСеврере(РезультатВыбора, ДополнительныеПараметры.ТекущаяСтрока);
	
КонецПроцедуры   

&НаСервере
Процедура ЗавершитьВыборРеквизитаНаСеврере(ИмяРеквизита, ТекущаяСтрока)
	
	СтрокаТекущая = Объект.СоответствиеРеквизитовМониторинговымПараметрам.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.ИмяРеквизита = ИмяРеквизита; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСхемы(ТекущаяСтрока)    
	
	СтрокаТекущая = Объект.СоответствиеРеквизитовМониторинговымПараметрам.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СоответствияИменРеквизитов = Перечисления.CW_РеквизитыКоносамента.ПолучитьСоответствияИменРеквизитов();
	ИмяРеквизита = СоответствияИменРеквизитов.Получить(СтрокаТекущая.РеквизитКоносамента);

	Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(Метаданные.Справочники.CW_Коносаменты.СтандартныеРеквизиты, ИмяРеквизита) Тогда
		Возврат Неопределено; //в стандартных реквизитах нет ссылочных типов
	КонецЕсли; 
	
	Если СтрНачинаетсяС(ИмяРеквизита, "СтрокаТаблицы") Тогда
		Реквизиты = Метаданные.Справочники.CW_Коносаменты.ТабличныеЧасти.ГрузовыеЕдиницы.Реквизиты;
	    ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "СтрокаТаблицы.", "");
	Иначе
		Реквизиты = Метаданные.Справочники.CW_Коносаменты.Реквизиты;
	КонецЕсли;
	
	Реквизит  = Реквизиты.Найти(ИмяРеквизита);  
	Если Реквизит = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПустоеЗначение 	= Реквизит.Тип.ПривестиЗначение(Неопределено);
	Если НЕ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ПустоеЗначение)) Тогда
		Возврат Неопределено; //Нужны только справочники
	КонецЕсли; 
	
	МетаданныСправочника = Метаданные.НайтиПоТипу(ТипЗнч(ПустоеЗначение));
	
	СхемаКомпоновкиДанных 	= Справочники.CW_ТипыКоносаментов.ПолучитьМакет("СхемаРеквизитов");
	ТекстЗапроса 			= СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;    
	ТекстЗапроса 			= СтрЗаменить(ТекстЗапроса, "CW_ТипыКонтейнеров", МетаданныСправочника.Имя);
	
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;	
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецФункции
